using System.Collections.Generic;

namespace ICN_T2.YokaiWatch.Common
{
    public static class FoodsType
    {
        public static readonly Dictionary<int, string> YW1 = new()
        {
            {0x00, " "}, {0x01, "주먹밥"}, {0x02, "빵"}, {0x03, "사탕"},
            {0x04, "우유"}, {0x05, "주스"}, {0x06, "햄버거"}, {0x08, "라면"},
            {0x0A, "중화요리"}, {0x0C, "야채"}, {0x0D, "고기"}, {0x0E, "해산물"},
        };

        public static readonly Dictionary<int, string> YW2 = new()
        {
            {0x00, " "}, {0x01, "주먹밥"}, {0x02, "빵"}, {0x03, "사탕"},
            {0x04, "우유"}, {0x05, "주스"}, {0x06, "햄버거"}, {0x07, "라면"},
            {0x08, "초밥"}, {0x09, "중화요리"}, {0x0B, "야채"}, {0x0C, "고기"},
            {0x0D, "해산물"}, {0x0E, "커리"}, {0x0F, "과자"}, {0x10, "오뎅"},
            {0x11, "소바"}, {0x12, "스낵"}, {0x13, "초코바"},
        };

        public static readonly Dictionary<int, string> YW3 = new()
        {
            {0x00, " "}, {0x01, "주먹밥"}, {0x02, "빵"}, {0x03, "사탕"},
            {0x04, "우유"}, {0x05, "주스"}, {0x06, "햄버거"}, {0x07, "라면"},
            {0x08, "초밥"}, {0x09, "중화요리"}, {0x0B, "야채"}, {0x0C, "고기"},
            {0x0D, "해산물"}, {0x0E, "커리"}, {0x0F, "과자"}, {0x10, "오뎅"},
            {0x11, "소바"}, {0x12, "스낵"}, {0x13, "초코바"}, {0x14, "아이스크림"},
            {0x15, "도넛"}, {0x16, "피자"}, {0x17, "핫도그"}, {0x18, "파스타"},
            {0x19, "튀김"}, {0x1A, "메가 맛바"}, {0x1C, "스키야키"},
        };
    }
}